Reports/ххх_ОтчетПоНеДвигающемусяТовару.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ххх_ОтчетПоНеДвигающемусяТовару</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Ассортимент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Ассортимент</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешеныЗакупки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеныПродажи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПланирования</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыМагазинов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ххх_ОтчетПоНеДвигающемусяТовару/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка=ложь;
	
	НАстройки=ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	//ДатаНачала=НАстройки.ПараметрыДанных.Элементы.Найти("Период").Значение.ДатаНачала;
	//ДатаОкончания=НАстройки.ПараметрыДанных.Элементы.Найти("Период").Значение.ДатаОкончания;
	
	
	
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("КоличествоДнейБезДвижений",НАстройки.ПараметрыДанных.Элементы.Найти("КоличествоДнейБезДвижений").Значение);
	Запрос.УстановитьПараметр("Номенклатура",НАстройки.ПараметрыДанных.Элементы.Найти("Номенклатура").Значение);
	Запрос.УстановитьПараметр("Магазин",НАстройки.ПараметрыДанных.Элементы.Найти("Магазин").Значение.Значение.ФорматМагазина);
	Запрос.УстановитьПараметр("Закуп",Справочники.ххх_Справочник.ЗакупочнаяЦена.Значение);
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТоварыНаСкладахОстаткиИОбороты.Период) КАК Период,
	|	ТоварыНаСкладахОстаткиИОбороты.Склад КАК Склад,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ йцу
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(, , День, ДвиженияИГраницыПериода, Номенклатура В ИЕРАРХИИ (&номенклатура)) КАК ТоварыНаСкладахОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстаткиИОбороты.Склад,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	йцу.Склад КАК Склад,
	|	йцу.Номенклатура КАК Номенклатура,
	|	РАЗНОСТЬДАТ(йцу.Период, &ТекущаяДата, ДЕНЬ) КАК КоличествоДнейБезДвижений,
	|	йцу.Период КАК Период,
	|	&ТекущаяДата КАК ТекущаяДата
	|ПОМЕСТИТЬ фыв
	|ИЗ
	|	йцу КАК йцу
	|
	|СГРУППИРОВАТЬ ПО
	|	йцу.Склад,
	|	йцу.Номенклатура,
	|	йцу.Период,
	|	РАЗНОСТЬДАТ(йцу.Период, &ТекущаяДата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	фыв.Склад КАК Склад,
	|	фыв.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА АссортиментСрезПоследних.РазрешеныЗакупки = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Допуск,
	|	фыв.КоличествоДнейБезДвижений КАК КоличествоДнейБезДвижений,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена КАК ЧИСЛО(15, 0)) КАК Цена,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТоварыНаСкладахОстатки.КоличествоОстаток КАК ЧИСЛО(15, 0)) КАК Сумма,
	|	фыв.Номенклатура.ххх_ИдЦентр КАК Номенклатураххх_ИдЦентр,
	|	ВЫРАЗИТЬ(Закуп.Цена КАК ЧИСЛО(15, 0)) КАК ЦенаЗакупа,
	|	ВЫРАЗИТЬ(Закуп.Цена * ТоварыНаСкладахОстатки.КоличествоОстаток КАК ЧИСЛО(15, 0)) КАК СуммаЗакупа
	|ИЗ
	|	фыв КАК фыв
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ПО фыв.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И фыв.Склад = ТоварыНаСкладахОстатки.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ассортимент.СрезПоследних(, ОбъектПланирования = &Магазин) КАК АссортиментСрезПоследних
	|		ПО фыв.Номенклатура = АссортиментСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|		ПО фыв.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И фыв.Склад.Магазин.ПравилоЦенообразования.ВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &Закуп) КАК Закуп
	|		ПО фыв.Номенклатура = Закуп.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток <> 0
	|	И фыв.КоличествоДнейБезДвижений >= &КоличествоДнейБезДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	фыв.Склад,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
	|	фыв.Номенклатура,
	|	фыв.КоличествоДнейБезДвижений,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА АссортиментСрезПоследних.РазрешеныЗакупки = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	фыв.Номенклатура.ххх_ИдЦентр,
	|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена КАК ЧИСЛО(15, 0)),
	|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТоварыНаСкладахОстатки.КоличествоОстаток КАК ЧИСЛО(15, 0)),
	|	Закуп.Цена
	|ИТОГИ
	|	МАКСИМУМ(Допуск),
	|	МАКСИМУМ(КоличествоДнейБезДвижений),
	|	МАКСИМУМ(ВидЦены),
	|	МАКСИМУМ(Цена),
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(Сумма),
	|	МАКСИМУМ(Номенклатураххх_ИдЦентр),
	|	МАКСИМУМ(ЦенаЗакупа),
	|	МАКСИМУМ(СуммаЗакупа)
	|ПО
	|	Склад,
	|	Номенклатура ИЕРАРХИЯ";

	
	
	
	//Запрос.УстановитьПараметр("ТзСмен", ТзСмен);
	
	//ТЗ = Запрос.Выполнить().Выгрузить();
	
	
	ВыборкаСклады=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Склад",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(100)));
	ТЗ.Колонки.Добавить("Путь",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(500)));
	ТЗ.Колонки.Добавить("ВидЦены",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(500)));
	ТЗ.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	ТЗ.Колонки.Добавить("Номенклатураххх_ИдЦентр",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(500)));
	ТЗ.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	//ТЗ.Колонки.Добавить("СуммаРесурс",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	ТЗ.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	//ТЗ.Колонки.Добавить("КоличествоРесурс",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	ТЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("КоличествоДнейБезДвижений",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,4)));
	ТЗ.Колонки.Добавить("Допуск",Новый ОписаниеТипов("Булево"));
	ТЗ.Колонки.Добавить("СуммаЗакупа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	ТЗ.Колонки.Добавить("ЦенаЗакупа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	
	
	//// Например чет там делаем, чего в запросе нельзя намутить
	//Для Каждого Стр Из ТЗ Цикл
	//	
	//	 СтрНов=ТЗ.Добавить();
	//	 СтрНов.строка=Стр.склад.Наименование+"/"+Стр.склад.Наименование+"/"+Стр.склад.Наименование;
	//	
	//КонецЦикла;
	
	СобратьТЗ(ВыборкаСклады,тз);
	
	тз.Свернуть("Склад,Путь,ВидЦены,Количество,Сумма,СуммаЗакупа,ЦенаЗакупа,Номенклатураххх_ИдЦентр,Контрагент,Цена,Номенклатура,КоличествоДнейБезДвижений,Допуск");
	//ЗАпрос=Новый запрос;
	//ЗАпрос.УстановитьПараметр("тз",тз);
	//Запрос.Текст="ВЫБРАТЬ
	//             |	тз.номенклатура КАК номенклатура,
	//             |	тз.Допуск КАК Допуск,
	//             |	тз.Склад КАК Склад,
	//             |	тз.КоличествоДнейБезДвижений КАК КоличествоДнейБезДвижений
	//             |ПОМЕСТИТЬ йцу
	//             |ИЗ
	//             |	&тз КАК тз
	//             |;
	//             |
	//             |////////////////////////////////////////////////////////////////////////////////
	//             |ВЫБРАТЬ
	//             |	йцу.номенклатура КАК номенклатура,
	//             |	йцу.Допуск КАК Допуск,
	//             |	йцу.Склад КАК Склад,
	//             |	йцу.КоличествоДнейБезДвижений КАК КоличествоДнейБезДвижений
	//             |ИЗ
	//             |	йцу КАК йцу";
	
	СтандартнаяОбработка = Ложь;
	//Связь между таблицей значений и именами в СКД 
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("НаборДанных1", тз);
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НАстройки, ДанныеРасшифровки);
	
	//Компоновка данных 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	//Вывод результата 
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
	
	
КонецПроцедуры











Процедура СобратьТЗ(ВыборкаСклады,тз)
	
	
	Пока ВыборкаСклады.следующий()Цикл
		
		
		ВыборкаНомкаИерархия=ВыборкаСклады.выбрать();
		
		Флаг=Ложь;
		//стр=тз.добавить();
		Путь="";
		Пока ВыборкаНомкаИерархия.следующий()Цикл
			
			//ВыборкаНомка=ВыборкаНомкаИерархия.выбрать();
			
			
			
			Если ВыборкаНомкаИерархия.Номенклатура.ЭтоГруппа Тогда
				
				//Номенклатура=Номенклатура+"/"+ВыборкаНомкаИерархия.Номенклатура.Наименование;
				
			Иначе
				
				
				Путь="";
				
				ПредокПредка=ВыборкаНомкаИерархия.Номенклатура.Родитель;
				
				Пока ЗначениеЗАполнено(ПредокПредка) Цикл
					
					Путь=ПредокПредка.Наименование+"/"+Путь;
					
					ПредокПредка=ПредокПредка.Родитель;
					
				КонецЦикла;
				
				
				стр=тз.добавить();
				стр.Номенклатура=ВыборкаНомкаИерархия.Номенклатура;
				стр.склад=ВыборкаНомкаИерархия.склад.наименование;
				стр.Путь=Путь;
				стр.Сумма=ВыборкаНомкаИерархия.сумма;
				стр.Допуск=ВыборкаНомкаИерархия.Допуск;
				стр.КоличествоДнейБезДвижений=ВыборкаНомкаИерархия.КоличествоДнейБезДвижений;
				стр.ВидЦены=ВыборкаНомкаИерархия.ВидЦены;
				стр.Количество=ВыборкаНомкаИерархия.Количество;
				стр.Цена=ВыборкаНомкаИерархия.Цена;
				стр.Номенклатураххх_ИдЦентр=ВыборкаНомкаИерархия.Номенклатураххх_ИдЦентр;
				стр.Контрагент=ВыборкаНомкаИерархия.Номенклатура.ххх_Поставщик;
				стр.СуммаЗакупа=ВыборкаНомкаИерархия.СуммаЗакупа;
				стр.ЦенаЗакупа=ВыборкаНомкаИерархия.ЦенаЗакупа;
				
				
				
				
			КонецЕсли;
			
			
			//	Пока выборкаНомка.следующий() Цикл
			//		
			//		
			//		Если Не ЗначениеЗаполнено(выборкаНомка.Период) Тогда
			//			
			//			//стр.Номенклатура=стр.Номенклатура+"/"+выборкаНомка.Номенклатура.Наименование;
			//			
			//		Иначе 
			//			
			//			Флаг=Истина;
			//			//стр.Номенклатура=стр.Номенклатура+"/"+выборкаНомка.Номенклатура.Наименование;
			//			стр.Допуск=выборкаНомка.Допуск;
			//			стр.КоличествоДнейБезДвижений=выборкаНомка.КоличествоДнейБезДвижений;
			//			
			//		КонецЕсли;
			//		
			//		
			//	КонецЦикла;
			//
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
